Reports/СправкаРасчетСебестоимостиПродукцииИУслугУправленческийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>СправкаРасчетСебестоимостиПродукцииИУслугУправленческийУчет</Name>
			<Comment>(упр)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Comment>1 - БУ, 2 - НУ, 3 - БУ, ПР, ВР</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОперации</Name>
					<Comment>1- продукция и услуги с плановыми ценами, 2 - услуги без плановых цен</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраняемыеРеквизиты</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьИнуюНастройку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/РасчетСебестоимостиПродукцииУправленческийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РасчетСебестоимостиПродукцииУправленческийУчет</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНЗП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСНЗП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРасчетаСебестоимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийРасчетаСебестоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасчетаСебестоимости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РасходыНаПроизводствоПродукцииИУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиБезИспользованияПлановыхЦен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпускПродукцииИУслуг</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/СправкаРасчетСебестоимостиПродукцииИУслугУправленческийУчет/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
	Перем НП Экспорт;
	
Функция СформироватьТекстЗапроса()
		
	Текст	= "ВЫБРАТЬ
			   |	РасчетСебестоимостиПродукции.ПериодРасчета КАК ПериодРасчета,
			   |	РасчетСебестоимостиПродукции.Подразделение КАК Подразделение,
			   |	РасчетСебестоимостиПродукции.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
			   |	РасчетСебестоимостиПродукции.Продукция КАК Продукция,
			   |	РасчетСебестоимостиПродукции.ХарактеристикаПродукции КАК ХарактеристикаПродукции,
			   |	РасчетСебестоимостиПродукции.СерияПродукции КАК СерияПродукции,
			   |	РасчетСебестоимостиПродукции.Заказ КАК Заказ,
			   |	РасчетСебестоимостиПродукции.Качество КАК Качество,
			   |	(РасчетСебестоимостиПродукции.СуммаПлан + РасчетСебестоимостиПродукции.НДСПлан) КАК СуммаПлан,
			   |	(РасчетСебестоимостиПродукции.Сумма + РасчетСебестоимостиПродукции.НДС) КАК Сумма,
			   |	(РасчетСебестоимостиПродукции.СуммаНЗП + РасчетСебестоимостиПродукции.НДСНЗП) КАК СуммаНЗП
			   |ИЗ
			   |	РегистрСведений.РасчетСебестоимостиПродукцииУправленческийУчет КАК РасчетСебестоимостиПродукции
			   |ГДЕ
			   |	РасчетСебестоимостиПродукции.Активность
			   |	И (НЕ РасчетСебестоимостиПродукции.ВидОперации = &УслугиБезПлановыхЦен)
			   |	И РасчетСебестоимостиПродукции.ПериодРасчета МЕЖДУ &ДатаНач И &ДатаКон
			   |ИТОГИ
			   |	МАКСИМУМ(СуммаПлан),
			   |	СУММА(Сумма),
			   |	СУММА(СуммаНЗП)
			   |ПО
			   |	ПериодРасчета,
			   |	Подразделение,
			   |	НоменклатурнаяГруппа,
			   |	Продукция, 
			   |	ХарактеристикаПродукции,
			   |	СерияПродукции,
			   |	Заказ,
			   |	Качество
			   |";
			   
	Возврат Текст;
		
КонецФункции
	
// Выполняет запрос и формирует табличный документ-результат отчета
	// в соответствии с настройками, заданными значениями реквизитов отчета.
	//
	// Параметры:
	//	ДокументРезультат - табличный документ, формируемый отчетом
	//	ПоказыватьЗаголовок - признак видимости строк с заголовком отчета
	//	ВысотаЗаголовка - параметр, через который возвращается высота заголовка в строках 
	//
Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок = Ложь, НачалоПодписи, ПоказыватьПодписи) Экспорт
		
	НачалоПериода = НачалоДня(ДатаНач);
	КонецПериода  = КонецДня(ДатаКон);
	
	ДокументРезультат.Очистить();
	
	Макет      = ПолучитьМакет("Отчет");
	// 37490 <<
	КодЯзыкаПечать = ЛокализацияПовтИсп.ПолучитьЯзыкФормированияПечатныхФормОтчетов();
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	// 37490 >>
	МакетОбщий = ПолучитьОбщийМакет("СправкаРасчет");
	// 37490 <<
	МакетОбщий.КодЯзыкаМакета = КодЯзыкаПечать;
	// 37490 >>
	
	ЗаголовокОтчета = МакетОбщий.ПолучитьОбласть("Заголовок");
	
	Если ТолькоЗаголовок Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВысотаЗаголовка) Тогда
		ДокументРезультат.Область("R1:R" + ВысотаЗаголовка).Видимость = ПоказыватьЗаголовок;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач",     НачалоДня(ДатаНач));
	Запрос.УстановитьПараметр("ДатаКон",     КонецДня(ДатаКон));
	Запрос.УстановитьПараметр("УслугиБезПлановыхЦен",  Перечисления.ВидыОперацийРасчетаСебестоимости.УслугиБезИспользованияПлановыхЦен);
	
	ОграниченияПоПостроителюОтчета = БухгалтерскиеОтчеты.ПолучитьТекстОграниченийПоПостроителюОтчета(ПостроительОтчета, Запрос);
	
	Если Не ПустаяСтрока(ОграниченияПоПостроителюОтчета) Тогда
		ОграниченияПоПостроителюОтчета = " И " + ОграниченияПоПостроителюОтчета;
	КонецЕсли;
	
	Запрос.Текст = СформироватьТекстЗапроса();
	
	Запрос.Текст  = СтрЗаменить(Запрос.Текст, "Активность", "Активность " + ОграниченияПоПостроителюОтчета);
	
	Если ВариантОперации = 2 Тогда
  		Запрос.Текст  = СтрЗаменить(Запрос.Текст, "НЕ РасчетСебестоимостиПродукцици.ВидОперации", "РасчетСебестоимостиПродукцици.ВидОперации");
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
			
	ОбластьШапка            = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаУслуги      = Макет.ПолучитьОбласть("ШапкаУслуги");
	ОбластьСтрока           = Макет.ПолучитьОбласть("Строка");
	ОбластьСтрокаУслуги     = Макет.ПолучитьОбласть("СтрокаУслуги");
	ОбластьПодСтрока        = Макет.ПолучитьОбласть("ПодСтрока");
	ОбластьИтого            = Макет.ПолучитьОбласть("Итого");
	ОбластьВсего            = Макет.ПолучитьОбласть("Всего");
	ОбластьВсегоУслуги      = Макет.ПолучитьОбласть("ВсегоУслуги");
	ОбластьОкончаниеТаблицы = Макет.ПолучитьОбласть("ОкончаниеТаблицы");
	ОбластьОкончаниеТаблицыУслуги = Макет.ПолучитьОбласть("ОкончаниеТаблицыУслуги");
	ОбластьПодвал           = МакетОбщий.ПолучитьОбласть("Подвал");
	
	ВыборкаПериод = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Всего = 0;
	ВсегоПериодБаза = 0;
	
	Пока ВыборкаПериод.Следующий() Цикл
		
		ЗаголовокОтчета.Параметры.Период              = "" + ПредставлениеПериода(НачалоМесяца(ВыборкаПериод.ПериодРасчета), КонецМесяца(ВыборкаПериод.ПериодРасчета), "ФП = Истина");
		// ЗаголовокОтчета.Параметры.НазваниеОрганизации = "" + Организация.НаименованиеПолное;
		ЗаголовокОтчета.Параметры.ДатаСоставления     = КонецМесяца(ВыборкаПериод.ПериодРасчета);
		ЗаголовокОтчета.Параметры.НазваниеОтчета      = НСтр("ru='Себестоимость ';uk='Собівартість '", КодЯзыкаПечать) + ?(ВариантОперации = 1, НСтр("ru='выпущенной продукции и ';uk='випущеної продукції й '", КодЯзыкаПечать), "") + НСтр("ru='оказанных услуг производственного характера, по которым ';uk='зроблених послуг виробничого характеру, по яких '", КодЯзыкаПечать) + ?(ВариантОперации = 2, НСтр("ru='не';uk='не'", КодЯзыкаПечать), "") + НСтр("ru=' предусмотрены плановые цены (управленческий учет)';uk=' передбачені планові ціни (управлінський облік)'", КодЯзыкаПечать);
		ДокументРезультат.Вывести(ЗаголовокОтчета);
		
		СтрОтбор = УправлениеОтчетами.СформироватьСтрокуОтборов(ПостроительОтчета.Отбор);
		Если Не ПустаяСтрока(СтрОтбор) Тогда
			ОбластьОтбор = МакетОбщий.ПолучитьОбласть("СтрокаОтбор");
			ОбластьОтбор.Параметры.ТекстПроОтбор = НСтр("ru='Отбор: ';uk='Відбір: '", КодЯзыкаПечать) + СтрОтбор;
			ДокументРезультат.Вывести(ОбластьОтбор);
		КонецЕсли;
		
		// Параметр для показа заголовка
		ВысотаЗаголовка = ДокументРезультат.ВысотаТаблицы;
		
		ОбластьШапка.Параметры.ТекстРасходов       = НСтр("ru='Прямые расходы (с НДС)';uk='Прямі витрати (з ПДВ)'", КодЯзыкаПечать);
		ОбластьШапка.Параметры.ТекстСебестоимости  = НСтр("ru='Сумма прямых расходов, приходящаяся на выпуск (с НДС)';uk='Сума прямих витрат, що припадає на випуск (з ПДВ)'", КодЯзыкаПечать);

		ДокументРезультат.Вывести(?(ВариантОперации = 2, ОбластьШапкаУслуги, ОбластьШапка));
		
		
		ВыборкаПодразделение = ВыборкаПериод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПодразделение.Следующий() Цикл
			ВыборкаНомГруппа = ВыборкаПодразделение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаНомГруппа.Следующий() Цикл
				ПерваяСтрока = Истина;
				ПоказыватьСтрокуИтого = Истина; 
				
				ВсегоБаза = 0;
				ВсегоСумма = 0;
				ВыборкаПродукция = ВыборкаНомГруппа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПродукция.Следующий() Цикл
				ВыборкаХарактеристикаПродукции = ВыборкаПродукция.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаХарактеристикаПродукции.Следующий() Цикл
				ВыборкаСерияПродукции = ВыборкаХарактеристикаПродукции.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаСерияПродукции.Следующий() Цикл
				ВыборкаЗаказ = ВыборкаСерияПродукции.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаЗаказ.Следующий() Цикл
				ВыборкаКачество = ВыборкаЗаказ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаКачество.Следующий() Цикл
					ВсегоБаза  = ВсегоБаза + ВыборкаКачество.СуммаПлан;
					ВсегоСумма = ВсегоСумма + ВыборкаКачество.СуммаПлан + ВыборкаКачество.Сумма;
				КонецЦикла;
				КонецЦикла;  	
				КонецЦикла;  	
				КонецЦикла;
				КонецЦикла;  	
				
				Если ВариантОперации = 1 Тогда
					
					ВыборкаПродукция = ВыборкаНомГруппа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаПродукция.Следующий() Цикл
					ВыборкаХарактеристикаПродукции = ВыборкаПродукция.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаХарактеристикаПродукции.Следующий() Цикл
					ВыборкаСерияПродукции = ВыборкаХарактеристикаПродукции.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаСерияПродукции.Следующий() Цикл
					ВыборкаЗаказ = ВыборкаСерияПродукции.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаЗаказ.Следующий() Цикл
					ВыборкаКачество = ВыборкаЗаказ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаКачество.Следующий() Цикл
						
						Если ВыборкаКачество.Сумма = 0 И ВыборкаКачество.СуммаПлан = 0 Тогда	
							Продолжить;
						КонецЕсли;
						
						Если ПерваяСтрока Тогда
							Область = ОбластьСтрока;
							Область.Параметры.Подразделение        = ВыборкаНомГруппа.Подразделение;
							Область.Параметры.НоменклатурнаяГруппа = ВыборкаНомГруппа.НоменклатурнаяГруппа;
							Область.Параметры.СуммаРасходовБезНЗП  = ВсегоСумма;
							Область.Параметры.СуммаНЗП             = ВыборкаНомГруппа.СуммаНЗП;
							Область.Параметры.СуммаРасходов        = ВсегоСумма + ВыборкаНомГруппа.СуммаНЗП;
						Иначе
							Область =  ОбластьПодСтрока;
						КонецЕсли;
						

						Область.Параметры.Продукция            = УправлениеПроизводством.ВыводНаименованияВыпуска(ВыборкаКачество.Продукция, Ложь, ВыборкаКачество.ХарактеристикаПродукции, ВыборкаКачество.СерияПродукции, ВыборкаКачество.Заказ, ВыборкаКачество.Качество);
						Область.Параметры.Коэффициент          = ?(ВсегоБаза = 0, 0, ВыборкаКачество.СуммаПлан / ВсегоБаза);
						Область.Параметры.СуммаБазы            = ВыборкаКачество.СуммаПлан;
						Область.Параметры.СуммаОтклонения      = ВыборкаКачество.Сумма;
						Область.Параметры.Сумма                = ВыборкаКачество.Сумма + ВыборкаКачество.СуммаПлан;
						ПоказыватьСтрокуИтого                  = Не (ВыборкаКачество.СуммаПлан = ВсегоБаза); 
						ВсегоПериодБаза = ВсегоПериодБаза +  ВыборкаКачество.СуммаПлан;
						
						ДокументРезультат.Вывести(Область);
						
						ПерваяСтрока = Ложь;
					КонецЦикла;  	
					КонецЦикла;  	
					КонецЦикла;  	
				    КонецЦикла;
					КонецЦикла;  	
				Иначе
					
					Если ВыборкаКачество.Сумма = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					Область = ОбластьСтрокаУслуги;
					Область.Параметры.Подразделение        = ВыборкаНомГруппа.Подразделение;
					Область.Параметры.НоменклатурнаяГруппа = ВыборкаНомГруппа.НоменклатурнаяГруппа;
					Область.Параметры.СуммаРасходовБезНЗП  = ВыборкаНомГруппа.Сумма + ВыборкаНомГруппа.СуммаПлан;
					Область.Параметры.СуммаНЗП             = ВыборкаНомГруппа.СуммаНЗП;
					Область.Параметры.СуммаРасходов        = ВыборкаНомГруппа.Сумма + ВыборкаНомГруппа.СуммаПлан + ВыборкаНомГруппа.СуммаНЗП;
					ВсегоПериодБаза = ВсегоПериодБаза +  ВыборкаНомГруппа.СуммаПлан;
					ПоказыватьСтрокуИтого                      = Ложь; 
					
					ДокументРезультат.Вывести(Область);
					
					
				КонецЕсли;
				
				
				Если ПоказыватьСтрокуИтого Тогда
					ОбластьИтого.Параметры.Сумма           = ВсегоСумма;
					ОбластьИтого.Параметры.СуммаБазы       = ВсегоБаза;
					ОбластьИтого.Параметры.СуммаОтклонения = ВсегоСумма - ВсегоБаза;
					ДокументРезультат.Вывести(ОбластьИтого);
					
				КонецЕсли;
				
			КонецЦикла;  // НомГруппа
		КонецЦикла;  //  Подразделение
		
		Область        = ?(ВариантОперации = 1, ОбластьВсего, ОбластьВсегоУслуги);
		
		Область.Параметры.СуммаРасходовБезНЗП  = ВыборкаПериод.Сумма + ВсегоПериодБаза;
		Область.Параметры.СуммаНЗП             = ВыборкаПериод.СуммаНЗП;
		Область.Параметры.СуммаРасходов        = ВыборкаПериод.Сумма + ВсегоПериодБаза + ВыборкаПериод.СуммаНЗП;
		Если ВариантОперации = 1 Тогда
			Область.Параметры.Сумма                = ВыборкаПериод.Сумма + ВсегоПериодБаза;
			Область.Параметры.СуммаБазы            = ВсегоПериодБаза;
			Область.Параметры.СуммаОтклонения      = Область.Параметры.Сумма - Область.Параметры.СуммаБазы;
		КонецЕсли;
		ДокументРезультат.Вывести(Область);
		ДокументРезультат.Вывести(?(ВариантОперации = 1, ОбластьОкончаниеТаблицы, ОбластьОкончаниеТаблицыУслуги));
		
		ОбластьПодвал.Параметры.ТекстПримечания = "";
		ДокументРезультат.Вывести(ОбластьПодвал);
		
		ВысотаПодписи = ДокументРезультат.Области.Подвал.Низ - ДокументРезультат.Области.Подвал.Верх;
		
		ДокументРезультат.Области.Подвал.Видимость = ПоказыватьПодписи;
		
	КонецЦикла;    // Период	
	
	// Зафиксируем заголовок отчета
	ДокументРезультат.ФиксацияСверху = 10;
	
	// Первую колонку не печатаем
	ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1,2,ДокументРезультат.ВысотаТаблицы,ДокументРезультат.ШиринаТаблицы);
	
	// Присвоим имя для сохранения параметров печати табличного документа
	ДокументРезультат.ИмяПараметровПечати = НСтр("ru='Расчет себестоимости продукции (упр. учет)';uk='Розрахунок собівартості продукції (упр. облік)'", КодЯзыкаПечать);
	
	УправлениеОтчетами.УстановитьКолонтитулыПоУмолчанию(ДокументРезультат, ЗаголовокОтчета, Строка(глЗначениеПеременной("глТекущийПользователь")));
	
КонецПроцедуры // СформироватьОтчет
	
	
////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
// 

НП = Новый НастройкаПериода;
	
#КонецЕсли
